score_count = int(input())
bonus = 0

# Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу.
# Да се напише програма, която пресмята бонус точките, които получава числото и общия брой точки (числото + бонуса).
# •	Ако числото е до 100 включително, бонус точките са 5;
if score_count <= 100:
    bonus = 5
# •	Ако числото е по-голямо от 100, бонус точките са 20% от числото;
elif score_count < 1000:
    bonus = score_count * 0.20
# •	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
else:
    bonus = score_count * 0.10
# •	Допълнителни бонус точки (начисляват се отделно от предходните):
# o	За четно число  + 1 т.
extra_bonus = 0
if score_count % 2 == 0:
    extra_bonus = 1
elif score_count % 10 == 5:
    extra_bonus = 2
# o	За число, което завършва на 5  + 2 т.
print(bonus + extra_bonus)
print(bonus + score_count + extra_bonus)
